tutorials/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/system/air/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // rotor cell zone
    {
        name    rotorCells;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name    cylinder;
        }
    }
    {
        name    rotorCells;
        type    cellSet;
        action  add;
        source  zoneToCell;
        sourceInfo
        {
            name    innerCylinder;
        }
    }
    {
        name    rotorCells;
        type    cellSet;
        action  subset;
        source  boxToCell;
        sourceInfo
        {
            box (-100 -100 0.1) (100 100 0.15);
        }
    }
    {
        name    rotor;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set rotorCells;
        }
    }
);


// ************************************************************************* //
